In [1]:
import pandas as pd

In [2]:
employee_names_table='employee_names.csv'

In [3]:
employee_cols=['id','first_name','last_name']

In [4]:
employees_names=pd.read_table(employee_names_table, sep=',', header=None, names=employee_cols, usecols=[0,1,2])

In [6]:
employee_pay_table='employee_pay.csv'

In [7]:
employee_pay_cols=['id','salary','bonus']

In [8]:
employees_pay=pd.read_table(employee_pay_table, sep=',', header=None, names=employee_pay_cols, usecols=[0,1,2])

In [10]:
leftouter_join=pd.merge(employees_names, employees_pay, how='left')

In [11]:
leftouter_join

                          id  first_name   last_name     salary     bonus
0                         id  first_name   last_name     salary     bonus
1   59ea7840fc13ae1f6d000096       Benny      Ventom  $84217.20       NaN
2   59ea7840fc13ae1f6d000097        Cara  Motherwell  $54737.84       NaN
3   59ea7840fc13ae1f6d000098      Willem    Haresign  $92092.21       NaN
4   59ea7840fc13ae1f6d000099       Trish     Farlane  $86117.63       NaN
5   59ea7840fc13ae1f6d00009a     Camilla     Limpkin  $92821.29       NaN
6   59ea7840fc13ae1f6d00009b      Godwin     Caffrey  $60633.55  $1779.07
7   59ea7840fc13ae1f6d00009c      Elvera      Custed  $94483.80  $4328.59
8   59ea7840fc13ae1f6d00009d      Vinson      Farres  $93127.77       NaN
9   59ea7840fc13ae1f6d00009e     Kliment   Pitchford  $90581.06       NaN
10  59ea7840fc13ae1f6d00009f       Matty      Heater  $86947.54       NaN
11  59ea7840fc13ae1f6d0000a0       Juana        Begg  $80646.00  $2924.69
12  59ea7840fc13ae1f6d0000a1        Alix       Layus  $50423.64  $1495.33
13  59ea7840fc13ae1f6d0000a2       Tessa     Brandes  $60695.47       NaN
14  59ea7840fc13ae1f6d0000a3      Hedwig     Fishley  $85763.22       NaN
15  59ea7840fc13ae1f6d0000a4    Cordelia      Aubray  $60600.37       NaN